package Part_1;

public class P1_E3 {
    public static void main(String[] args) {
        /*
        Таблиця переведення доларов в грн
         */
    double dol, grn;
    int count;
        count = 0; //треба це писать, не забувать
                // в числах должна точка стоять, не кома

        for (dol = 1; dol <= 100; dol++) {
                 grn = dol * 25.32;
                 System.out.println( dol + " долар, равен " + grn + " гривен");
                 count++;

             if (count == 5) {
             count = 0;
             System.out.println();
    }
    }


        /*Результат
        1.0 долар, равен 25.32 гривен
        2.0 долар, равен 50.64 гривен
        3.0 долар, равен 75.96000000000001 гривен
        4.0 долар, равен 101.28 гривен
        5.0 долар, равен 126.6 гривен

        6.0 долар, равен 151.92000000000002 гривен
        7.0 долар, равен 177.24 гривен
        8.0 долар, равен 202.56 гривен
        9.0 долар, равен 227.88 гривен
        10.0 долар, равен 253.2 гривен

        11.0 долар, равен 278.52 гривен
        12.0 долар, равен 303.84000000000003 гривен
        13.0 долар, равен 329.16 гривен
        14.0 долар, равен 354.48 гривен
        15.0 долар, равен 379.8 гривен

        16.0 долар, равен 405.12 гривен
        ........
         */


    }
}
